app/controllers/movies_controller.rb

	def create
    	#@movie = Movie.create!(params[:movie]) #old way
    	@movie = Movie.create!(movie_params)  # new way
---
INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Test"], ["rating", "G"], ["release_date", "2017-10-08 00:00:00.000000"], ["created_at", "2017-10-08 23:48:06.217972"], ["updated_at", "2017-10-08 23:48:06.217972"]]

	def update
    	@movie = Movie.find params[:id]
	    #@movie.update_attributes!(params[:movie])  # old way
	    @movie.update_attributes!(movie_params)  # new way
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 11]]
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Movie3-updated"], ["updated_at", "2017-10-09 02:18:20.845591"], ["id", 10]]